# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertexArray..::..ForwardIterator Method
SlabShapeVertexArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual SlabShapeVertexArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As SlabShapeVertexArrayIterator
```

Visual C++
---
```text
public:
virtual SlabShapeVertexArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace